npccfg: [ function(t, e) {
"use strict";
cc._RF.push(e, "58239F7uStPc7VplYIt/NV7", "npccfg");
e.exports = {
1: {
name: "国王",
des: "勇者也得996! 愣着干嘛？干活去！！！",
func: [ {
k: "需要帮助",
f: 1
}, {
k: "兑换码",
f: 13
} ]
},
2: {
name: "商人",
des: "银鳞胸甲5金一件，貌似走错片场了。想批量卖装备去右边铁匠那",
func: [ {
k: "购买道具",
f: 2,
p: 1
}, {
k: "出售道具",
f: 10,
p: 1
} ]
},
3: {
name: "附魔师",
des: "传说有些怪物会掉落更稀有的附魔配方,这里没有卡拉赞，但真的有猫鼬。",
func: [ {
k: "装备附魔",
f: 3
}, {
k: "购买材料",
f: 2,
p: 2
}, {
k: "购买水晶",
f: 2,
p: 3
} ]
},
4: {
name: "铁匠",
des: "打怪练级穿装备里的装备全靠我，我不像凯丽那家伙+个5就掉链子。",
func: [ {
k: "铁匠铺",
f: 4
}, {
k: "分解装备",
f: 7
} ]
},
5: {
name: "宠物大师",
des: "我是来自假旧镇的大蠢，据说首领怪物也有概率出宝宝,甚至还有可能闪光。",
func: [ {
k: "宠物店",
f: 5
}, {
k: "捕获列表",
f: 17
} ]
},
6: {
name: "银行",
des: "这里可以保管装备，宠物，你注意到中间的宝箱是黑的吗？因为这地图是对称的。",
func: [ {
k: "存",
f: 8
}, {
k: "取",
f: 9
} ]
},
7: {
name: "小女孩",
des: "我这里可以改变您的形象，颜值即正义",
func: [ {
k: "形象修改",
f: 11
} ]
},
8: {
name: "合成大师",
des: "我这里可以合成装备，前提你得解锁配方，你问为何我看上去像个武术家？作者懒得找角色而已。",
func: [ {
k: "合成",
f: 12
} ]
},
100: {
name: "传送阵",
des: "萌新记得加点，在左上角背包旁边",
func: [ {
k: "刷怪去",
f: 6
} ]
},
101: {
condition: {
sy: 51
},
name: "传送阵？",
des: "。。。这里的怪很强,非洲乐园品质随机",
func: [ {
k: "非洲乐园",
f: 2,
p: 101
}, {
k: "刷怪去",
f: 14
}, {
k: "无尽模式",
f: 15
}, {
k: "无尽1w层",
f: 16
} ]
}
};
cc._RF.pop();
}, {} ],
